Repository: smc/smc
Catalog: pychathans/po/chathans-*.po
Languages: ml

source: Chathans requires PyGTK
ml: ചാത്തന്‍സിന് pygtk ആവശ്യമാണ്

source: Chathans requires Payyans
ml: ചാത്തന്‍സിന് പയ്യന്‍സ് ആവശ്യമാണ്

source: Chathans
ml: ചാത്തന്‍സ്

source: ASCII File :
ml: ആസ്കി ഫയല്‍

source: Mapping File :
ml: മാപ്പിങ്ങ് ഫയല്‍

source: Unicode File :
ml: യൂണിക്കോഡ് ഫയല്‍

source: Select the ASCII-Unicode Mapping File
ml: ആസ്കി-യുണിക്കോഡ് മാപ്പിങ്ങ് ഫയല്‍ തിരഞ്ഞെടുക്കുക

source: ASCII-to-Unicode
ml: ആസ്കി-യൂണിക്കോഡ്

source: Unicode-to-ASCII
ml: യൂണിക്കോഡ്-ആസ്കി

source: Convert
ml: പരിവര്‍ത്തനം ചെയ്യുക

source: Quit
ml: പുറത്ത് പോവുക

source: About
ml: സംബന്ധിച്ച്

source: Select the ASCII File (.txt,.pdf)
ml: ആസ്കി ഫയല്‍ (.txt,.pdf) തിരഞ്ഞെടുക്കുക

source: Select the Unicode File
ml: യൂണിക്കോഡ് ഫയല്‍ തിരഞ്ഞെടുക്കുക

source: Please select both Input file and Mapping file
ml: ദയവായി പരിവര്‍ത്തനം ചെയ്യേണ്ട ഫയലും മാപ്പിങ്ങ് ഫയലും തിരഞ്ഞെടുക്കുക

source: Coversion Done - Unicode file :
ml: പരിവര്‍ത്തനം ചെയ്തു കഴിഞ്ഞു - യൂണിക്കോഡ് ഫയല്‍ :

source: Conversion Done - ASCII file :
ml: പരിവര്‍ത്തനം ചെയ്തു കഴിഞ്ഞു - ആസ്കി ഫയല്‍ :

source: Could not find the pdftotext utility. Exiting...
ml: pdftotext ഉപാധി കണ്ടെത്താന്‍ സാധിച്ചില്ല. നിര്‍ത്തുന്നു...

source: Syntax Error in Mapping file. Exiting...
ml: മാപ്പിങ്ങ് ഫയലില്‍ വ്യാകരണപ്പിശകുണ്ട്. നിര്‍ത്തുന്നു...

source: Chathans: Rajeesh K Nambiar <rajeeshknambiar@gmail.com>
ml: ചാത്തന്‍സ് : രജീഷ് കെ നമ്പ്യാര്‍ <rajeeshknambiar@gmail.com>

source: Payyans : Santhosh Thottingal, Nishan Naseer, Manu S Madhav, Rajeesh K Nambiar
ml: പയ്യന്‍സ് :‌ സന്തോഷ് തോട്ടിങ്ങല്‍, നിഷാന്‍ നസീര്‍, മനു എസ് മാധവ്, രജീഷ് കെ നമ്പ്യാര്‍

source: Chathans is an easy to use GUI frontend to Payyans ASCII<->Unicode Converter
ml: ചാത്തന്‍സ് ഉപയോഗിക്കാന്‍ എളുപ്പമുള്ള, പയ്യന്‍സ് ആസ്കി<->യൂണിക്കോഡ് പരിവര്‍ത്തകനു വേണ്ടിയുള്ള ഒരു അഭിമുഖോപാധിയാണ്

source: Copyright (c) Rajeesh K Nambiar
ml: പകര്‍പ്പവകാശം (c) രജീഷ് കെ നമ്പ്യാര്‍

source: Chathans is licensed under GNU GPL version 3
ml: ചാത്തന്‍സ് ഗ്നു ജിപിഎല്‍ മൂന്നാം പതിപ്പു പ്രകാരം സംരക്ഷിക്കപ്പെട്ടിരിക്കുന്നു

source: Do you really want to Quit?
ml: പുറത്ത് കടക്കണമെന്ന് താങ്കള്‍ക്ക് തീര്‍ച്ചയാണോ?
